VatEngine/datacolor.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <AnalyseDocument xmlns="http://tempuri.org/">
      <document><![CDATA[<?xml version="1.0" encoding="UTF-8"?><?xml-stylesheet type="text/xsl" href="http://www.vatat.com/xml/vatat_invoice_view_jscript.xsl"?><iVATEngineInput><Supplier><ID>14</ID><Name>Datacolor AG Europe</Name><Country>CH</Country><SpecialType>0</SpecialType><VATNumberSupplier Country="BE"><VATNumber>BE0879779805</VATNumber><VATNumberType>02</VATNumberType></VATNumberSupplier><VATNumberSupplier Country="CH"><VATNumber>CHE-116.284.080 MWST</VATNumber><VATNumberType>01</VATNumberType></VATNumberSupplier><VATNumberSupplier Country="DE"><VATNumber>DE812030457</VATNumber><VATNumberType>03</VATNumberType></VATNumberSupplier><VATNumberSupplier Country="GB"><VATNumber>GB764528994</VATNumber><VATNumberType>01</VATNumberType></VATNumberSupplier><CountryChosenVATNumber>CH</CountryChosenVATNumber></Supplier><Customer><ID>69336</ID><Name>SPECTRUM INDUSTRIES LLC</Name><Country>AE</Country><SpecialType>0</SpecialType><CountryChosenVATNumber></CountryChosenVATNumber></Customer><InvoiceProperties><DocumentType>0</DocumentType><Currency1>USD</Currency1><InvoiceNumber>506314</InvoiceNumber></InvoiceProperties><Item><Properties><Description>6000-0232</Description><ItemClassificationCode>100</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>.0000</UnitPriceExclVAT><TotalAmountExclVAT>.00</TotalAmountExclVAT></Amounts><Number>1.000</Number><Unit>EA</Unit><AdditionalProperties>S</AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT></DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>1.000</OwnItemReference></Item><Item><Properties><Description>8800-0164</Description><ItemClassificationCode>253</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>174.3173</UnitPriceExclVAT><TotalAmountExclVAT>871.59</TotalAmountExclVAT></Amounts><Number>5.000</Number><Unit>HR</Unit><AdditionalProperties>S</AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT></DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>2.000</OwnItemReference></Item> <Item><Properties><Description>FREIGHT</Description><ItemClassificationCode>100</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>454.6775</UnitPriceExclVAT><TotalAmountExclVAT>454.68</TotalAmountExclVAT></Amounts><Number>1.000</Number><Unit>EA</Unit><AdditionalProperties>S</AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT></DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>3.000</OwnItemReference></Item><Item><Properties><Description>1030-1616</Description><ItemClassificationCode>100</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>14028.6654</UnitPriceExclVAT><TotalAmountExclVAT>14028.67</TotalAmountExclVAT></Amounts><Number>1.000</Number><Unit>EA</Unit><AdditionalProperties></AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT>310</DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>4.000</OwnItemReference></Item><Item><Properties><Description>1015-0241</Description><ItemClassificationCode>100</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>8189.5215</UnitPriceExclVAT><TotalAmountExclVAT>8189.52</TotalAmountExclVAT></Amounts><Number>1.000</Number><Unit>EA</Unit><AdditionalProperties></AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT>470</DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>5.000</OwnItemReference></Item> <Item><Properties><Description>8800-0710</Description><ItemClassificationCode>253</ItemClassificationCode><Amounts CurrencyNumber="1"><UnitPriceExclVAT>666.2793</UnitPriceExclVAT><TotalAmountExclVAT>666.28</TotalAmountExclVAT></Amounts><Number>1.000</Number><Unit>EA</Unit><AdditionalProperties>S</AdditionalProperties><OutOfVAT>0</OutOfVAT><DeductibleVAT>193</DeductibleVAT></Properties><Conditions><ShipFrom><CountryDeparture>CH</CountryDeparture></ShipFrom><ShipTo><CountryArrival>AE</CountryArrival></ShipTo><CountryOperation>AE</CountryOperation><CountryEUImportation></CountryEUImportation><Installation>0</Installation><Transporter>0</Transporter><Incoterm>DAP</Incoterm><Importer>1</Importer><Triangulation>0</Triangulation><DateTransaction>2020-12-20</DateTransaction><ForCharity>0</ForCharity></Conditions><OwnItemReference>6.000</OwnItemReference></Item><CallerReferenceID>DATACOLOR</CallerReferenceID></iVATEngineInput>
]]></document>
    </AnalyseDocument>
  </soap:Body>
</soap:Envelope>